Revit 2027 API
BeamSystem.BeamSystemType Property
Retrieves or changes the type of the BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BeamSystemType BeamSystemType { get; set; }
Public Property BeamSystemType As BeamSystemType
	Get
	Set
public:
property BeamSystemType^ BeamSystemType {
	BeamSystemType^ get ();
	void set (BeamSystemType^ value);
}
member BeamSystemType : BeamSystemType with get, set
Property Value
BeamSystemType
Example
public void GetInfo_BeamSystemType(BeamSystem beamSystem)
{
    string message = "BeamSystem : ";
    // Get BeamSystem type name
    message += "\nBeamSystem type name : " + beamSystem.BeamSystemType.Name;
    // Rename the BeamSystem type used by this BeamSystem
    beamSystem.BeamSystemType.Name = "TestBeamSystemTypeName";
    // Get BeamSystem type name
    message += "\nBeamSystem type name after set: " + beamSystem.BeamSystemType.Name;
    TaskDialog.Show("Revit",message);
}
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace